podonoghue/usbdm-flash-routines/S12Z-FTMRZ-flash-program/Project_Headers/mc9s12zvml128.h
/* Based on CPU DB MC9S12ZVML128_64, version 3.00.000 (RegistersPrg V2.33) */
/*
** ###################################################################
**     Filename  : mc9s12zvml128.h
**     Processor : MC9S12ZVML128MKH
**     FileFormat: V2.33
**     DataSheet : Rev. 1.2 23 APR 2013
**     Compiler  : CodeWarrior compiler
**     Date/Time : 6/27/2013, 9:39 AM
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2013 Freescale Semiconductor, Inc. All Rights Reserved.
**     SOURCE DISTRIBUTION PERMISSIBLE as directed in End User License Agreement.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**      - 12.1.2012, V3.00.0:
**              - Registers updated according to the new reference manual revision - Rev. 0.09, 12 Dec 2011
**              - ECC: Removed registers ECCADDRx. 
**              - DBG: Data and data mask registers listed with indexes 0-3. Corrected bit indexing of DBGAD, DBGADM, DBGCD, DBGCDM registers.
**              - PIM: Changed the bitnames of MODRR0/1/2 to more meaningful names. Corrected the address of PIMMISC register.
**              - FTMRZ: Removed wait state description (WSTAT). Register NVFPSTAT changed to FPROTKEY.
**              - PMF: Bits VLMODE[0:1] merged to the VLMODE group. Bits ISENS[0:1] merged to the ISENS group.
**              - CPMU: Removed illegal address reset flag (ILAF).
**      - 25.06.2012, V3.00.1:
**              - ADC0,ADC1: Added pointers to the 24-bit registers ADCxCBP, ADCxRBP.
**              - CAN: Added CAN0 module
**              - DBG: Added pointers to the 24-bit registers DBGAA, DBGBA, DBGCA, DBGDA.
**              - MMC: Added pointer to the 24-bit register MMCPC.
**              - PTU: Added pointer to the 24-bit register PTUPTR.
**              - SRAM_ECC: Added pointer to the 24-bit register ECCDPTR.
**      - 04.09.2012, V3.00.2:
**              - Updates for new silicon revision (V2.0)
**              - Registers updated according to the new reference manual revision - Rev. 0.13, 03 Aug 2012
**              - Removed X-GATE reference and registers: INT_XGPRIO, INT_CFDATAx[RQST].
**              - FTMRZ: Added wait state control bits WSTATACK, WSTAT. Removed double bit fault detect interrupt bits: DFDIE, rename DFDIF to DFDF.
**              - ADC: Fix RIDX_IMD size. 
**              - GDU: New module version (GDUV2), new module base address (0x6A0). Rename GCSxE bits to GCSEx, rename GCSxO bits to GCSOx, added overcurrent interrupt enable bit GOCIE, rename GDUPHS register to GDUSTAT and added extra status bits GOCS, GHHDS, GLVLSS. Added extra flags to GDUF register: GSUF, GOCIF. Added overcurrent registers: GDUOC0, GDUOC1.
**              - CPMU: Added CPMUOSC2 register.
**      - 16.05.2013, V3.00.3:
**              - Updates for new silicon revision (V3.0)
**              - Registers updated according to the new reference manual revision - Rev. 1.2, 23 APR 2013
**              - CPU: Removed mapping of VRL to PAD7
**              - PARTID: New part id value
**              - SCI: Moved bits IREN, TNP1, TNP0 to SCIACR22 register. Added bits SBR15, SBR14, SBR13 to SCIBDH1 register.
**              - LINPHY: Removed LPOC bit and added LPDT bit to LPSR register. Moved LPOCIE bit and added LPDTIE bit to LPIE register. Moved LPOCIF bit and added LPDTIF bit to LPIF register.
**
**     File-Format-Revisions:
**               - none
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S12ZVML128_H
#define _MC9S12ZVML128_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma bfield_gap_limit -1 /*this guarantee correct bitfield positions*/

/**************** interrupt vector numbers ****************/
#define VectorNumber_VReserved123       123U
#define VectorNumber_VReserved122       122U
#define VectorNumber_VReserved121       121U
#define VectorNumber_VReserved120       120U
#define VectorNumber_VReserved119       119U
#define VectorNumber_VReserved118       118U
#define VectorNumber_VReserved117       117U
#define VectorNumber_VReserved116       116U
#define VectorNumber_VReserved115       115U
#define VectorNumber_VReserved114       114U
#define VectorNumber_VReserved113       113U
#define VectorNumber_VReserved112       112U
#define VectorNumber_VReserved111       111U
#define VectorNumber_VReserved110       110U
#define VectorNumber_VReserved109       109U
#define VectorNumber_VReserved108       108U
#define VectorNumber_VReserved107       107U
#define VectorNumber_VReserved106       106U
#define VectorNumber_VReserved105       105U
#define VectorNumber_VReserved104       104U
#define VectorNumber_VReserved103       103U
#define VectorNumber_VReserved102       102U
#define VectorNumber_VReserved101       101U
#define VectorNumber_VReserved100       100U
#define VectorNumber_VReserved99        99U
#define VectorNumber_VReserved98        98U
#define VectorNumber_VReserved97        97U
#define VectorNumber_VReserved96        96U
#define VectorNumber_VReserved95        95U
#define VectorNumber_VReserved94        94U
#define VectorNumber_VReserved93        93U
#define VectorNumber_VReserved92        92U
#define VectorNumber_VReserved91        91U
#define VectorNumber_VReserved90        90U
#define VectorNumber_VReserved89        89U
#define VectorNumber_VReserved88        88U
#define VectorNumber_VReserved87        87U
#define VectorNumber_VReserved86        86U
#define VectorNumber_VReserved85        85U
#define VectorNumber_VReserved84        84U
#define VectorNumber_VReserved83        83U
#define VectorNumber_VReserved82        82U
#define VectorNumber_VReserved81        81U
#define VectorNumber_VReserved80        80U
#define VectorNumber_Vpmfro             79U
#define VectorNumber_Vpmffault          78U
#define VectorNumber_Vpmfrc             77U
#define VectorNumber_Vpmfrb             76U
#define VectorNumber_Vpmfra             75U
#define VectorNumber_VReserved74        74U
#define VectorNumber_VReserved73        73U
#define VectorNumber_VReserved72        72U
#define VectorNumber_Vptutg1dn          71U
#define VectorNumber_Vptutg0dn          70U
#define VectorNumber_Vptutg1err         69U
#define VectorNumber_Vptutg0err         68U
#define VectorNumber_Vpturo             67U
#define VectorNumber_Vportad            66U
#define VectorNumber_VReserved65        65U
#define VectorNumber_Vhti               64U
#define VectorNumber_Vapi               63U
#define VectorNumber_Vlvi               62U
#define VectorNumber_Vevddx             61U
#define VectorNumber_Vportp             60U
#define VectorNumber_VReserved59        59U
#define VectorNumber_Vadc1conv_compl    58U
#define VectorNumber_Vadc1conv_seq_abrt 57U
#define VectorNumber_Vadc1err           56U
#define VectorNumber_VReserved55        55U
#define VectorNumber_Vports             54U
#define VectorNumber_VReserved53        53U
#define VectorNumber_VReserved52        52U
#define VectorNumber_VReserved51        51U
#define VectorNumber_VReserved50        50U
#define VectorNumber_Vgdu_vld           49U
#define VectorNumber_Vgdu_des_err       48U
#define VectorNumber_Vbats              47U
#define VectorNumber_Vlinphy0           46U
#define VectorNumber_VReserved45        45U
#define VectorNumber_VReserved44        44U
#define VectorNumber_Vcan0tx            43U
#define VectorNumber_Vcan0rx            42U
#define VectorNumber_Vcan0err           41U
#define VectorNumber_Vcan0wkup          40U
#define VectorNumber_Vflash             39U
#define VectorNumber_Vflasherr          38U
#define VectorNumber_VReserved37        37U
#define VectorNumber_VReserved36        36U
#define VectorNumber_VRAM_err           35U
#define VectorNumber_VReserved34        34U
#define VectorNumber_VReserved33        33U
#define VectorNumber_Vcpmuplllck        32U
#define VectorNumber_Vcpmuosc           31U
#define VectorNumber_Vadc0conv_compl    30U
#define VectorNumber_Vadc0conv_seq_abrt 29U
#define VectorNumber_Vadc0err           28U
#define VectorNumber_VReserved27        27U
#define VectorNumber_VReserved26        26U
#define VectorNumber_Vsci1              25U
#define VectorNumber_Vsci0              24U
#define VectorNumber_Vspi0              23U
#define VectorNumber_VReserved22        22U
#define VectorNumber_VReserved21        21U
#define VectorNumber_Vtim0ovf           20U
#define VectorNumber_VReserved19        19U
#define VectorNumber_VReserved18        18U
#define VectorNumber_VReserved17        17U
#define VectorNumber_VReserved16        16U
#define VectorNumber_Vtim0ch3           15U
#define VectorNumber_Vtim0ch2           14U
#define VectorNumber_Vtim0ch1           13U
#define VectorNumber_Vtim0ch0           12U
#define VectorNumber_Vrti               11U
#define VectorNumber_Virq               10U
#define VectorNumber_Vxirq              9U
#define VectorNumber_Vsi                8U
#define VectorNumber_VReserved7         7U
#define VectorNumber_VReserved6         6U
#define VectorNumber_Vme                5U
#define VectorNumber_Vsys               4U
#define VectorNumber_Vswi               3U
#define VectorNumber_Vtrap              2U
#define VectorNumber_Vspare             1U
#define VectorNumber_Vreset             0U

