podonoghue/usbdm-flash-routines/S12Z-FTMRZ-flash-program/Project_Headers/mc9s12zvml128.h
#define PMFCFG1_TOPNEGA_MASK            1U
#define PMFCFG1_BOTNEGA_MASK            2U
#define PMFCFG1_TOPNEGB_MASK            4U
#define PMFCFG1_BOTNEGB_MASK            8U
#define PMFCFG1_TOPNEGC_MASK            16U
#define PMFCFG1_BOTNEGC_MASK            32U
#define PMFCFG1_ENCE_MASK               64U


/*** PMFCFG2 - PMF Configure 2 Register; 0x00000502 ***/
typedef union {
  byte Byte;
  struct {
    byte MSK0        :1;                                       /* Mask PWM0 Bit0 */
    byte MSK1        :1;                                       /* Mask PWM1 Bit1 */
    byte MSK2        :1;                                       /* Mask PWM2 Bit2 */
    byte MSK3        :1;                                       /* Mask PWM3 Bit3 */
    byte MSK4        :1;                                       /* Mask PWM4 Bit4 */
    byte MSK5        :1;                                       /* Mask PWM5 Bit5 */
    byte REV0        :1;                                       /* Reload event Bit0 */
    byte REV1        :1;                                       /* Reload event Bit1 */
  } Bits;
  struct {
    byte grpMSK  :6;
    byte grpREV  :2;
  } MergedBits;
} PMFCFG2STR;
extern volatile PMFCFG2STR _PMFCFG2 @0x00000502;
#define PMFCFG2                         _PMFCFG2.Byte
#define PMFCFG2_MSK0                    _PMFCFG2.Bits.MSK0
#define PMFCFG2_MSK1                    _PMFCFG2.Bits.MSK1
#define PMFCFG2_MSK2                    _PMFCFG2.Bits.MSK2
#define PMFCFG2_MSK3                    _PMFCFG2.Bits.MSK3
#define PMFCFG2_MSK4                    _PMFCFG2.Bits.MSK4
#define PMFCFG2_MSK5                    _PMFCFG2.Bits.MSK5
#define PMFCFG2_REV0                    _PMFCFG2.Bits.REV0
#define PMFCFG2_REV1                    _PMFCFG2.Bits.REV1
#define PMFCFG2_MSK                     _PMFCFG2.MergedBits.grpMSK
#define PMFCFG2_REV                     _PMFCFG2.MergedBits.grpREV

#define PMFCFG2_MSK0_MASK               1U
#define PMFCFG2_MSK1_MASK               2U
#define PMFCFG2_MSK2_MASK               4U
#define PMFCFG2_MSK3_MASK               8U
#define PMFCFG2_MSK4_MASK               16U
#define PMFCFG2_MSK5_MASK               32U
#define PMFCFG2_REV0_MASK               64U
#define PMFCFG2_REV1_MASK               128U
#define PMFCFG2_MSK_MASK                63U
#define PMFCFG2_MSK_BITNUM              0U
#define PMFCFG2_REV_MASK                192U
#define PMFCFG2_REV_BITNUM              6U


/*** PMFCFG3 - PMF Configure 3 Register; 0x00000503 ***/
typedef union {
  byte Byte;
  struct {
    byte PINVA       :1;                                       /* PWM Invert Complement Source Pair A */
    byte PINVB       :1;                                       /* PWM Invert Complement Source Pair B */
    byte PINVC       :1;                                       /* PWM Invert Complement Source Pair C */
    byte VLMODE      :2;                                       /* Value Register Load Mode */
    byte             :1; 
    byte PMFFRZ      :1;                                       /* PMF Stops While in FREEZE Mode */
    byte PMFWAI      :1;                                       /* PMF Stops While in WAIT Mode */
  } Bits;
  struct {
    byte grpPINVx :3;
    byte         :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PMFCFG3STR;
extern volatile PMFCFG3STR _PMFCFG3 @0x00000503;
#define PMFCFG3                         _PMFCFG3.Byte
#define PMFCFG3_PINVA                   _PMFCFG3.Bits.PINVA
#define PMFCFG3_PINVB                   _PMFCFG3.Bits.PINVB
#define PMFCFG3_PINVC                   _PMFCFG3.Bits.PINVC
#define PMFCFG3_VLMODE                  _PMFCFG3.Bits.VLMODE
#define PMFCFG3_PMFFRZ                  _PMFCFG3.Bits.PMFFRZ
#define PMFCFG3_PMFWAI                  _PMFCFG3.Bits.PMFWAI
#define PMFCFG3_PINVx                   _PMFCFG3.MergedBits.grpPINVx

#define PMFCFG3_PINVA_MASK              1U
#define PMFCFG3_PINVB_MASK              2U
#define PMFCFG3_PINVC_MASK              4U
#define PMFCFG3_VLMODE_MASK             24U
#define PMFCFG3_VLMODE_BITNUM           3U
#define PMFCFG3_PMFFRZ_MASK             64U
#define PMFCFG3_PMFWAI_MASK             128U
#define PMFCFG3_PINVx_MASK              7U
#define PMFCFG3_PINVx_BITNUM            0U


/*** PMFFEN - PMF Fault Enable Register; 0x00000504 ***/
typedef union {
  byte Byte;
  struct {
    byte FEN0        :1;                                       /* Fault 0 Enable */
    byte FEN1        :1;                                       /* Fault 1 Enable */
    byte FEN2        :1;                                       /* Fault 2 Enable */
    byte FEN3        :1;                                       /* Fault 3 Enable */
    byte FEN4        :1;                                       /* Fault 4 Enable */
    byte             :1; 
    byte FEN5        :1;                                       /* Fault 5 Enable */
    byte             :1; 
  } Bits;
  struct {
    byte grpFEN  :5;
    byte         :1;
    byte grpFEN_5 :1;
    byte         :1;
  } MergedBits;
} PMFFENSTR;
extern volatile PMFFENSTR _PMFFEN @0x00000504;
#define PMFFEN                          _PMFFEN.Byte
#define PMFFEN_FEN0                     _PMFFEN.Bits.FEN0
#define PMFFEN_FEN1                     _PMFFEN.Bits.FEN1
#define PMFFEN_FEN2                     _PMFFEN.Bits.FEN2
#define PMFFEN_FEN3                     _PMFFEN.Bits.FEN3
#define PMFFEN_FEN4                     _PMFFEN.Bits.FEN4
#define PMFFEN_FEN5                     _PMFFEN.Bits.FEN5
#define PMFFEN_FEN                      _PMFFEN.MergedBits.grpFEN

#define PMFFEN_FEN0_MASK                1U
#define PMFFEN_FEN1_MASK                2U
#define PMFFEN_FEN2_MASK                4U
#define PMFFEN_FEN3_MASK                8U
#define PMFFEN_FEN4_MASK                16U
#define PMFFEN_FEN5_MASK                64U
#define PMFFEN_FEN_MASK                 31U
#define PMFFEN_FEN_BITNUM               0U


/*** PMFFMOD - PMF Fault Mode Register; 0x00000505 ***/
typedef union {
  byte Byte;
  struct {
    byte FMOD0       :1;                                       /* Fault 0 Pin Clearing Mode */
    byte FMOD1       :1;                                       /* Fault 1 Pin Clearing Mode */
    byte FMOD2       :1;                                       /* Fault 2 Pin Clearing Mode */
    byte FMOD3       :1;                                       /* Fault 3 Pin Clearing Mode */
    byte FMOD4       :1;                                       /* Fault 4 Pin Clearing Mode */
    byte             :1; 
    byte FMOD5       :1;                                       /* Fault 5 Pin Clearing Mode */
    byte             :1; 
  } Bits;
  struct {
    byte grpFMOD :5;
    byte         :1;
    byte grpFMOD_5 :1;
    byte         :1;
  } MergedBits;
} PMFFMODSTR;
extern volatile PMFFMODSTR _PMFFMOD @0x00000505;
#define PMFFMOD                         _PMFFMOD.Byte
#define PMFFMOD_FMOD0                   _PMFFMOD.Bits.FMOD0
#define PMFFMOD_FMOD1                   _PMFFMOD.Bits.FMOD1
#define PMFFMOD_FMOD2                   _PMFFMOD.Bits.FMOD2
#define PMFFMOD_FMOD3                   _PMFFMOD.Bits.FMOD3
#define PMFFMOD_FMOD4                   _PMFFMOD.Bits.FMOD4
#define PMFFMOD_FMOD5                   _PMFFMOD.Bits.FMOD5
#define PMFFMOD_FMOD                    _PMFFMOD.MergedBits.grpFMOD

