podonoghue/usbdm-flash-routines/S12Z-FTMRZ-flash-program/Project_Headers/mc9s12zvml128.h
/*** PTUIFH - PTU Interrupt Flag Register High; 0x00000584 ***/
typedef union {
  byte Byte;
  struct {
    byte PTUROIF     :1;                                       /* PTU Reload Overrun Interrupt Flag */
    byte PTUDEEF     :1;                                       /* PTU Double bit ECC Error Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PTUIFHSTR;
extern volatile PTUIFHSTR _PTUIFH @0x00000584;
#define PTUIFH                          _PTUIFH.Byte
#define PTUIFH_PTUROIF                  _PTUIFH.Bits.PTUROIF
#define PTUIFH_PTUDEEF                  _PTUIFH.Bits.PTUDEEF

#define PTUIFH_PTUROIF_MASK             1U
#define PTUIFH_PTUDEEF_MASK             2U


/*** PTUIFL - PTU Interrupt Flag Register Low; 0x00000585 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0DIF      :1;                                       /* Trigger Generator 0 Done Interrupt Flag */
    byte TG0EIF      :1;                                       /* Trigger Generator 0 Timing Error Interrupt Flag */
    byte TG0REIF     :1;                                       /* Trigger Generator 0 Reload Error Interrupt Flag */
    byte TG0AEIF     :1;                                       /* Trigger Generator 0 Memory Access Error Interrupt Flag */
    byte TG1DIF      :1;                                       /* Trigger Generator 1 Done Interrupt Flag */
    byte TG1EIF      :1;                                       /* Trigger Generator 1 Timing Error Interrupt Flag */
    byte TG1REIF     :1;                                       /* Trigger Generator 1 Reload Error Interrupt Flag */
    byte TG1AEIF     :1;                                       /* Trigger Generator 1 Memory Access Error Interrupt Flag */
  } Bits;
} PTUIFLSTR;
extern volatile PTUIFLSTR _PTUIFL @0x00000585;
#define PTUIFL                          _PTUIFL.Byte
#define PTUIFL_TG0DIF                   _PTUIFL.Bits.TG0DIF
#define PTUIFL_TG0EIF                   _PTUIFL.Bits.TG0EIF
#define PTUIFL_TG0REIF                  _PTUIFL.Bits.TG0REIF
#define PTUIFL_TG0AEIF                  _PTUIFL.Bits.TG0AEIF
#define PTUIFL_TG1DIF                   _PTUIFL.Bits.TG1DIF
#define PTUIFL_TG1EIF                   _PTUIFL.Bits.TG1EIF
#define PTUIFL_TG1REIF                  _PTUIFL.Bits.TG1REIF
#define PTUIFL_TG1AEIF                  _PTUIFL.Bits.TG1AEIF

#define PTUIFL_TG0DIF_MASK              1U
#define PTUIFL_TG0EIF_MASK              2U
#define PTUIFL_TG0REIF_MASK             4U
#define PTUIFL_TG0AEIF_MASK             8U
#define PTUIFL_TG1DIF_MASK              16U
#define PTUIFL_TG1EIF_MASK              32U
#define PTUIFL_TG1REIF_MASK             64U
#define PTUIFL_TG1AEIF_MASK             128U


/*** TG0LIST - Trigger Generator 0 List Register; 0x00000586 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0LIST_bit :1;                                       /* Trigger Generator 0 List */ /*Warning: bit name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TG0LISTSTR;
extern volatile TG0LISTSTR _TG0LIST @0x00000586;
#define TG0LIST                         _TG0LIST.Byte
#define TG0LIST_TG0LIST                 _TG0LIST.Bits.TG0LIST_bit

#define TG0LIST_TG0LIST_MASK            1U


/*** TG0TNUM - Trigger Generator 0 Trigger Number Register; 0x00000587 ***/
typedef union {
  byte Byte;
  struct {
    byte TG0TNUM_grp :5;                                       /* Trigger Generator 0 Trigger Number */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TG0TNUMSTR;
extern volatile TG0TNUMSTR _TG0TNUM @0x00000587;
#define TG0TNUM                         _TG0TNUM.Byte
#define TG0TNUM_TG0TNUM                 _TG0TNUM.Bits.TG0TNUM_grp

#define TG0TNUM_TG0TNUM_MASK            31U
#define TG0TNUM_TG0TNUM_BITNUM          0U


/*** TG0TVH - Trigger Generator 0 Trigger Value; 0x00000588 ***/
typedef union {
  byte Byte;
} TG0TVHSTR;
extern volatile TG0TVHSTR _TG0TVH @0x00000588;
#define TG0TVH                          _TG0TVH.Byte


/*** TG0TVL - Trigger Generator 0 Trigger Value; 0x00000589 ***/
typedef union {
  byte Byte;
} TG0TVLSTR;
extern volatile TG0TVLSTR _TG0TVL @0x00000589;
#define TG0TVL                          _TG0TVL.Byte


/*** TG1LIST - Trigger Generator 1 List Register; 0x0000058A ***/
typedef union {
  byte Byte;
  struct {
    byte TG1LIST_bit :1;                                       /* Trigger Generator 1 List */ /*Warning: bit name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TG1LISTSTR;
extern volatile TG1LISTSTR _TG1LIST @0x0000058A;
#define TG1LIST                         _TG1LIST.Byte
#define TG1LIST_TG1LIST                 _TG1LIST.Bits.TG1LIST_bit

#define TG1LIST_TG1LIST_MASK            1U


/*** TG1TNUM - Trigger Generator 1 Trigger Number Register; 0x0000058B ***/
typedef union {
  byte Byte;
  struct {
    byte TG1TNUM_grp :5;                                       /* Trigger Generator 1 Trigger Number */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TG1TNUMSTR;
extern volatile TG1TNUMSTR _TG1TNUM @0x0000058B;
#define TG1TNUM                         _TG1TNUM.Byte
#define TG1TNUM_TG1TNUM                 _TG1TNUM.Bits.TG1TNUM_grp

#define TG1TNUM_TG1TNUM_MASK            31U
#define TG1TNUM_TG1TNUM_BITNUM          0U


/*** TG1TVH - Trigger Generator 1 Trigger Value; 0x0000058C ***/
typedef union {
  byte Byte;
} TG1TVHSTR;
extern volatile TG1TVHSTR _TG1TVH @0x0000058C;
#define TG1TVH                          _TG1TVH.Byte


/*** TG1TVL - Trigger Generator 1 Trigger Value; 0x0000058D ***/
typedef union {
  byte Byte;
} TG1TVLSTR;
