podonoghue/usbdm-flash-routines/S12Z-FTMRZ-flash-program/Project_Headers/mc9s12zvml128.h
  struct {
    word RIDX_IMD    :6;                                       /* RES_IDX Value At Intermediate Event */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word RVL_IMD     :1;                                       /* Active RVL At Intermediate Event */
    word CSL_IMD     :1;                                       /* Active CSL At Intermediate Event */
  } Bits;
} ADC1IMDRISTR;
extern volatile ADC1IMDRISTR _ADC1IMDRI @0x0000064E;
#define ADC1IMDRI                       _ADC1IMDRI.Word
#define ADC1IMDRI_RIDX_IMD              _ADC1IMDRI.Bits.RIDX_IMD
#define ADC1IMDRI_RVL_IMD               _ADC1IMDRI.Bits.RVL_IMD
#define ADC1IMDRI_CSL_IMD               _ADC1IMDRI.Bits.CSL_IMD

#define ADC1IMDRI_RIDX_IMD_MASK         63U
#define ADC1IMDRI_RIDX_IMD_BITNUM       0U
#define ADC1IMDRI_RVL_IMD_MASK          16384U
#define ADC1IMDRI_CSL_IMD_MASK          32768U


/*** ADC1EOLRI - ADC1 End Of List Result Information Register; 0x00000650 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RVL_EOL     :1;                                       /* Active RVL When End Of List Command Type Was Executed */
    byte CSL_EOL     :1;                                       /* Active CSL When End Of List Command Type Was Executed */
  } Bits;
} ADC1EOLRISTR;
extern volatile ADC1EOLRISTR _ADC1EOLRI @0x00000650;
#define ADC1EOLRI                       _ADC1EOLRI.Byte
#define ADC1EOLRI_RVL_EOL               _ADC1EOLRI.Bits.RVL_EOL
#define ADC1EOLRI_CSL_EOL               _ADC1EOLRI.Bits.CSL_EOL

#define ADC1EOLRI_RVL_EOL_MASK          64U
#define ADC1EOLRI_CSL_EOL_MASK          128U


/*** ADC1CMD - ADC1 Command Register; 0x00000654 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** ADC1CMD_01 - ADC1 Command Register 01; 0x00000654 ***/
    union {
      word Word;
       /* Overlapped registers: */
      struct {
        /*** ADC1CMD_0 - ADC1 Command Register 0; 0x00000654 ***/
        union {
          byte Byte;
          struct {
            byte INTFLG_SEL  :4;                                       /* Conversion Interrupt Flag Select */
            byte             :1; 
            byte             :1; 
            byte CMD_SEL     :2;                                       /* Conversion Command Select */
          } Bits;
        } ADC1CMD_0STR;
        #define ADC1CMD_0               _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Overlap_STR.ADC1CMD_0STR.Byte
        #define ADC1CMD_0_INTFLG_SEL    _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Overlap_STR.ADC1CMD_0STR.Bits.INTFLG_SEL
        #define ADC1CMD_0_CMD_SEL       _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Overlap_STR.ADC1CMD_0STR.Bits.CMD_SEL
        /* ADC1CMD__ARR: Access 4 ADC1CMD_x registers in an array */
        #define ADC1CMD__ARR            ((volatile byte *) &ADC1CMD_0)
        
        #define ADC1CMD_0_INTFLG_SEL_MASK 15U
        #define ADC1CMD_0_INTFLG_SEL_BITNUM 0U
        #define ADC1CMD_0_CMD_SEL_MASK  192U
        #define ADC1CMD_0_CMD_SEL_BITNUM 6U
        
    
        /*** ADC1CMD_1 - ADC1 Command Register 1; 0x00000655 ***/
        union {
          byte Byte;
          struct {
            byte CH_SEL      :6;                                       /* ADC Input Channel Select */
            byte VRL_SEL     :1;                                       /* Reference Low Voltage Select */
            byte VRH_SEL     :1;                                       /* Reference High Voltage Select */
          } Bits;
        } ADC1CMD_1STR;
        #define ADC1CMD_1               _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Overlap_STR.ADC1CMD_1STR.Byte
        #define ADC1CMD_1_CH_SEL        _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Overlap_STR.ADC1CMD_1STR.Bits.CH_SEL
        #define ADC1CMD_1_VRL_SEL       _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Overlap_STR.ADC1CMD_1STR.Bits.VRL_SEL
        #define ADC1CMD_1_VRH_SEL       _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Overlap_STR.ADC1CMD_1STR.Bits.VRH_SEL
        
        #define ADC1CMD_1_CH_SEL_MASK   63U
        #define ADC1CMD_1_CH_SEL_BITNUM 0U
        #define ADC1CMD_1_VRL_SEL_MASK  64U
        #define ADC1CMD_1_VRH_SEL_MASK  128U
        
      } Overlap_STR;
    
      struct {
        word CH_SEL      :6;                                       /* ADC Input Channel Select */
        word VRL_SEL     :1;                                       /* Reference Low Voltage Select */
        word VRH_SEL     :1;                                       /* Reference High Voltage Select */
        word INTFLG_SEL  :4;                                       /* Conversion Interrupt Flag Select */
        word             :1; 
        word             :1; 
        word CMD_SEL     :2;                                       /* Conversion Command Select */
      } Bits;
    } ADC1CMD_01STR;
    #define ADC1CMD_01                  _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Word
    #define ADC1CMD_01_CH_SEL           _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Bits.CH_SEL
    #define ADC1CMD_01_VRL_SEL          _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Bits.VRL_SEL
    #define ADC1CMD_01_VRH_SEL          _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Bits.VRH_SEL
    #define ADC1CMD_01_INTFLG_SEL       _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Bits.INTFLG_SEL
    #define ADC1CMD_01_CMD_SEL          _ADC1CMD.Overlap_STR.ADC1CMD_01STR.Bits.CMD_SEL
    
    #define ADC1CMD_01_CH_SEL_MASK      63U
    #define ADC1CMD_01_CH_SEL_BITNUM    0U
    #define ADC1CMD_01_VRL_SEL_MASK     64U
    #define ADC1CMD_01_VRH_SEL_MASK     128U
    #define ADC1CMD_01_INTFLG_SEL_MASK  3840U
    #define ADC1CMD_01_INTFLG_SEL_BITNUM 8U
    #define ADC1CMD_01_CMD_SEL_MASK     49152U
    #define ADC1CMD_01_CMD_SEL_BITNUM   14U
    

    /*** ADC1CMD_23 - ADC1 Command Register 23; 0x00000656 ***/
    union {
      word Word;
       /* Overlapped registers: */
      struct {
        /*** ADC1CMD_2 - ADC1 Command Register 2; 0x00000656 ***/
        union {
          byte Byte;
          struct {
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte SMP         :5;                                       /* Sample Time Select */
          } Bits;
        } ADC1CMD_2STR;
        #define ADC1CMD_2               _ADC1CMD.Overlap_STR.ADC1CMD_23STR.Overlap_STR.ADC1CMD_2STR.Byte
        #define ADC1CMD_2_SMP           _ADC1CMD.Overlap_STR.ADC1CMD_23STR.Overlap_STR.ADC1CMD_2STR.Bits.SMP
        
