podonoghue/usbdm-flash-routines/S12Z-FTMRZ-flash-program/Project_Headers/mc9s12zvml128.h
        #define ADC1CMD_2_SMP_MASK      248U
        #define ADC1CMD_2_SMP_BITNUM    3U
        
    
        /*** ADC1CMD_3 - ADC1 Command Register 3; 0x00000657 ***/
        union {
          byte Byte;
          struct {
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
          } Bits;
        } ADC1CMD_3STR;
        #define ADC1CMD_3               _ADC1CMD.Overlap_STR.ADC1CMD_23STR.Overlap_STR.ADC1CMD_3STR.Byte
        
      } Overlap_STR;
    
      struct {
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word             :1; 
        word SMP         :5;                                       /* Sample Time Select */
      } Bits;
    } ADC1CMD_23STR;
    #define ADC1CMD_23                  _ADC1CMD.Overlap_STR.ADC1CMD_23STR.Word
    #define ADC1CMD_23_SMP              _ADC1CMD.Overlap_STR.ADC1CMD_23STR.Bits.SMP
    
    #define ADC1CMD_23_SMP_MASK         63488U
    #define ADC1CMD_23_SMP_BITNUM       11U
    
  } Overlap_STR;

} ADC1CMDSTR;
extern volatile ADC1CMDSTR _ADC1CMD @0x00000654;
#define ADC1CMD                         _ADC1CMD.Dword


/*** ADC1CIDX - ADC1 Command Index Register; 0x0000065C ***/
typedef union {
  byte Byte;
  struct {
    byte CMD_IDX     :6;                                       /* ADC Command Index */
    byte             :1; 
    byte             :1; 
  } Bits;
} ADC1CIDXSTR;
extern volatile ADC1CIDXSTR _ADC1CIDX @0x0000065C;
#define ADC1CIDX                        _ADC1CIDX.Byte
#define ADC1CIDX_CMD_IDX                _ADC1CIDX.Bits.CMD_IDX

#define ADC1CIDX_CMD_IDX_MASK           63U
#define ADC1CIDX_CMD_IDX_BITNUM         0U


/*** ADC1CBP_0 - ADC1 Command Base Pointer Register 0; 0x0000065D ***/
typedef union {
  byte Byte;
  struct {
    byte CMD_PTR     :8;                                       /* ADC Command Base Pointer Address */
  } Bits;
} ADC1CBP_0STR;
extern volatile ADC1CBP_0STR _ADC1CBP_0 @0x0000065D;
#define ADC1CBP_0                       _ADC1CBP_0.Byte
#define ADC1CBP_0_CMD_PTR               _ADC1CBP_0.Bits.CMD_PTR
/* ADC1CBP__ARR: Access 3 ADC1CBP_x registers in an array */
#define ADC1CBP__ARR                    ((volatile byte *) &ADC1CBP_0)

#define ADC1CBP_0_CMD_PTR_MASK          255U
#define ADC1CBP_0_CMD_PTR_BITNUM        0U


/*** ADC1CBP_1 - ADC1 Command Base Pointer Register 1; 0x0000065E ***/
typedef union {
  byte Byte;
  struct {
    byte CMD_PTR     :8;                                       /* ADC Command Base Pointer Address */
  } Bits;
} ADC1CBP_1STR;
extern volatile ADC1CBP_1STR _ADC1CBP_1 @0x0000065E;
#define ADC1CBP_1                       _ADC1CBP_1.Byte
#define ADC1CBP_1_CMD_PTR               _ADC1CBP_1.Bits.CMD_PTR

#define ADC1CBP_1_CMD_PTR_MASK          255U
#define ADC1CBP_1_CMD_PTR_BITNUM        0U


/*** ADC1CBP_2 - ADC1 Command Base Pointer Register 2; 0x0000065F ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte CMD_PTR     :6;                                       /* ADC Command Base Pointer Address */
  } Bits;
} ADC1CBP_2STR;
extern volatile ADC1CBP_2STR _ADC1CBP_2 @0x0000065F;
#define ADC1CBP_2                       _ADC1CBP_2.Byte
#define ADC1CBP_2_CMD_PTR               _ADC1CBP_2.Bits.CMD_PTR

#define ADC1CBP_2_CMD_PTR_MASK          252U
#define ADC1CBP_2_CMD_PTR_BITNUM        2U


/*** ADC1RIDX - ADC1 Result Index Register; 0x00000660 ***/
typedef union {
  byte Byte;
  struct {
    byte RES_IDX     :6;                                       /* ADC Result Index */
    byte             :1; 
    byte             :1; 
  } Bits;
} ADC1RIDXSTR;
extern volatile ADC1RIDXSTR _ADC1RIDX @0x00000660;
#define ADC1RIDX                        _ADC1RIDX.Byte
#define ADC1RIDX_RES_IDX                _ADC1RIDX.Bits.RES_IDX

#define ADC1RIDX_RES_IDX_MASK           63U
#define ADC1RIDX_RES_IDX_BITNUM         0U


/*** ADC1RBP_0 - ADC1 Result Base Pointer Register 0; 0x00000661 ***/
typedef union {
  byte Byte;
  struct {
    byte RES_PTR     :4;                                       /* ADC Result Base Pointer Address */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ADC1RBP_0STR;
extern volatile ADC1RBP_0STR _ADC1RBP_0 @0x00000661;
#define ADC1RBP_0                       _ADC1RBP_0.Byte
#define ADC1RBP_0_RES_PTR               _ADC1RBP_0.Bits.RES_PTR
/* ADC1RBP__ARR: Access 3 ADC1RBP_x registers in an array */
#define ADC1RBP__ARR                    ((volatile byte *) &ADC1RBP_0)

#define ADC1RBP_0_RES_PTR_MASK          15U
#define ADC1RBP_0_RES_PTR_BITNUM        0U


/*** ADC1RBP_1 - ADC1 Result Base Pointer Register 1; 0x00000662 ***/
typedef union {
  byte Byte;
  struct {
    byte RES_PTR     :8;                                       /* ADC Result Base Pointer Address */
  } Bits;
} ADC1RBP_1STR;
extern volatile ADC1RBP_1STR _ADC1RBP_1 @0x00000662;
#define ADC1RBP_1                       _ADC1RBP_1.Byte
#define ADC1RBP_1_RES_PTR               _ADC1RBP_1.Bits.RES_PTR

#define ADC1RBP_1_RES_PTR_MASK          255U
#define ADC1RBP_1_RES_PTR_BITNUM        0U


/*** ADC1RBP_2 - ADC1 Result Base Pointer Register 2; 0x00000663 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte RES_PTR     :6;                                       /* ADC Result Base Pointer Address */
  } Bits;
} ADC1RBP_2STR;
extern volatile ADC1RBP_2STR _ADC1RBP_2 @0x00000663;
#define ADC1RBP_2                       _ADC1RBP_2.Byte
#define ADC1RBP_2_RES_PTR               _ADC1RBP_2.Bits.RES_PTR

#define ADC1RBP_2_RES_PTR_MASK          252U
#define ADC1RBP_2_RES_PTR_BITNUM        2U


/*** ADC1CROFF0 - ADC1 Command and Result Offset Register 0; 0x00000664 ***/
typedef union {
  byte Byte;
  struct {
    byte CMDRES_OFF0 :7;                                       /* ADC Command and Result Offset Value refer to CSL_0 and RVL_0 */
    byte             :1; 
  } Bits;
} ADC1CROFF0STR;
