podonoghue/usbdm-flash-routines/S12Z-FTMRZ-flash-program/Project_Headers/mc9s12zvml128.h
/*** NVFSEC - Non Volatile Flash Security Register; 0x00FFFE0F ***/
typedef union {
  byte Byte;
  struct {
    byte SEC0        :1;                                       /* Flash Security Bit 0 */
    byte SEC1        :1;                                       /* Flash Security Bit 1 */
    byte RNV2        :1;                                       /* Reserved Nonvolatile Bit 2 */
    byte RNV3        :1;                                       /* Reserved Nonvolatile Bit 3 */
    byte RNV4        :1;                                       /* Reserved Nonvolatile Bit 4 */
    byte RNV5        :1;                                       /* Reserved Nonvolatile Bit 5 */
    byte KEYEN0      :1;                                       /* Backdoor Key Security Enable Bit 0 */
    byte KEYEN1      :1;                                       /* Backdoor Key Security Enable Bit 1 */
  } Bits;
  struct {
    byte grpSEC  :2;
    byte grpRNV_2 :4;
    byte grpKEYEN :2;
  } MergedBits;
} NVFSECSTR;
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x00FFFE0F = <NVFSEC_INITVAL>; */
#define _NVFSEC (*(const NVFSECSTR *)0x00FFFE0F)
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_RNV2                     _NVFSEC.Bits.RNV2
#define NVFSEC_RNV3                     _NVFSEC.Bits.RNV3
#define NVFSEC_RNV4                     _NVFSEC.Bits.RNV4
#define NVFSEC_RNV5                     _NVFSEC.Bits.RNV5
#define NVFSEC_KEYEN0                   _NVFSEC.Bits.KEYEN0
#define NVFSEC_KEYEN1                   _NVFSEC.Bits.KEYEN1
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_RNV_2                    _NVFSEC.MergedBits.grpRNV_2
#define NVFSEC_KEYEN                    _NVFSEC.MergedBits.grpKEYEN
#define NVFSEC_RNV                      NVFSEC_RNV_2

#define NVFSEC_SEC0_MASK                1U
#define NVFSEC_SEC1_MASK                2U
#define NVFSEC_RNV2_MASK                4U
#define NVFSEC_RNV3_MASK                8U
#define NVFSEC_RNV4_MASK                16U
#define NVFSEC_RNV5_MASK                32U
#define NVFSEC_KEYEN0_MASK              64U
#define NVFSEC_KEYEN1_MASK              128U
#define NVFSEC_SEC_MASK                 3U
#define NVFSEC_SEC_BITNUM               0U
#define NVFSEC_RNV_2_MASK               60U
#define NVFSEC_RNV_2_BITNUM             2U
#define NVFSEC_KEYEN_MASK               192U
#define NVFSEC_KEYEN_BITNUM             6U


/* * * * *  24-BIT ADDRESS REGISTERS  * * * * * * * * * * * * * * * * * * * * * * */
extern volatile void* volatile MMCPC @0x00000085;          /* Captured S12ZCPU Program Counter Low; 0x00000087 */
extern volatile void* volatile DBGAA @0x00000115;          /* Debug Comparator A Address Register Low; 0x00000117 */
extern volatile void* volatile DBGBA @0x00000125;          /* Debug Comparator B Address Register Low; 0x00000127 */
extern volatile void* volatile DBGCA @0x00000135;          /* Debug Comparator C Address Register Low; 0x00000137 */
extern volatile void* volatile DBGDA @0x00000145;          /* Debug Comparator D Address Register Low; 0x00000147 */
extern volatile void* volatile ECCDPTR @0x000003C7;        /* ECC Debug Point Register Low; 0x000003C9 */
extern volatile void* volatile PTUPTR @0x00000591;         /* PTU Pointer Register; 0x00000593 */
extern volatile void* volatile ADC0CBP @0x0000061D;        /* ADC0 Command Base Pointer Register 0; 0x00000593 */
extern volatile void* volatile ADC0RBP @0x00000621;        /* ADC0 Result Base Pointer Register 0; 0x00000593 */
extern volatile void* volatile ADC1CBP @0x0000065D;        /* ADC1 Command Base Pointer Register 0; 0x00000593 */
extern volatile void* volatile ADC1RBP @0x00000661;        /* ADC1 Result Base Pointer Register 0; 0x00000593 */


  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 1/12/2012 2:56:04 PM */

#define ECCADDRH                         This_symb_has_been_depreciated
#define ECCADDRH_ECCADDR                 This_symb_has_been_depreciated
#define ECCADDRH_ECCADDR_MASK            This_symb_has_been_depreciated
#define ECCADDRH_ECCADDR_BITNUM          This_symb_has_been_depreciated
#define ECCADDRM                         This_symb_has_been_depreciated
#define ECCADDRM_ECCADDR                 This_symb_has_been_depreciated
#define ECCADDRM_ECCADDR_MASK            This_symb_has_been_depreciated
#define ECCADDRM_ECCADDR_BITNUM          This_symb_has_been_depreciated
#define ECCADDRL                         This_symb_has_been_depreciated
#define ECCADDRL_ECCADDR                 This_symb_has_been_depreciated
#define ECCADDRL_ECCADDR_MASK            This_symb_has_been_depreciated
#define ECCADDRL_ECCADDR_BITNUM          This_symb_has_been_depreciated
#define DBGAD                            DBGAD0
#define DBGADM                           DBGADM0
#define DBGCD                            DBGCD0
#define DBGCDM                           DBGCDM0
#define MODRR0_S0LRR                     MODRR0_S0L0RR
#define MODRR0_SPIRR                     MODRR0_SPI0RR
#define MODRR0_SPISSRR                   MODRR0_SPI0SSRR
#define MODRR0_S0LRR_MASK                MODRR0_S0L0RR_MASK
#define MODRR0_S0LRR_BITNUM              MODRR0_S0L0RR_BITNUM
#define MODRR0_SPIRR_MASK                MODRR0_SPI0RR_MASK
#define MODRR0_SPISSRR_MASK              MODRR0_SPI0SSRR_MASK
#define MODRR2_IC1RR                     MODRR2_T0IC1RR
#define MODRR2_IC3RR                     MODRR2_T0IC3RR
#define MODRR2_IC1RR_MASK                MODRR2_T0IC1RR_MASK
#define MODRR2_IC3RR_MASK                MODRR2_T0IC3RR_MASK
#define MODRR2_IC3RR_BITNUM              MODRR2_T0IC3RR_BITNUM
#define PMFCFG3_VLMODE0                  This_symb_has_been_depreciated
#define PMFCFG3_VLMODE1                  This_symb_has_been_depreciated
#define PMFCFG3_VLMODE0_MASK             This_symb_has_been_depreciated
#define PMFCFG3_VLMODE1_MASK             This_symb_has_been_depreciated
#define PMFCCTL_ISENS0                   This_symb_has_been_depreciated
#define PMFCCTL_ISENS1                   This_symb_has_been_depreciated
#define PMFCCTL_ISENS0_MASK              This_symb_has_been_depreciated
#define PMFCCTL_ISENS1_MASK              This_symb_has_been_depreciated
#define CPMURFLG_ILAF                    This_symb_has_been_depreciated
#define CPMURFLG_ILAF_MASK               This_symb_has_been_depreciated
#define _NVFPSTAT                        _PROTKEY
#define NVFPSTAT                         PROTKEY
#define NVFPSTAT_FPOVRD                  This_symb_has_been_depreciated
#define NVFPSTAT_FPOVRD_MASK             This_symb_has_been_depreciated

/* **** 9/05/2012 10:09:14 AM */
#define INT_XGPRIO                       This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL                 This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL_MASK            This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL_BITNUM          This_symb_has_been_depreciated
#define INT_CFDATA0_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA1_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA2_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA3_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA4_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA5_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA6_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA7_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA0_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA1_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA2_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA3_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA4_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA5_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA6_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA7_RQST_MASK            This_symb_has_been_depreciated
#define FERCNFG_DFDIE                    This_symb_has_been_depreciated
#define FERCNFG_DFDIE_MASK               This_symb_has_been_depreciated
#define FERSTAT_DFDIF                    This_symb_has_been_depreciated
#define FERSTAT_DFDIF_MASK               This_symb_has_been_depreciated
#define GDUE_GCS0E                       This_symb_has_been_depreciated
#define GDUE_GCS1E                       This_symb_has_been_depreciated
#define GDUE_GCS0E_MASK                  This_symb_has_been_depreciated
#define GDUE_GCS1E_MASK                  This_symb_has_been_depreciated
#define GDUIE_GLVLSFIE                   This_symb_has_been_depreciated
#define GDUIE_GHHDFIE                    This_symb_has_been_depreciated
#define GDUIE_GLVLSFIE_MASK              This_symb_has_been_depreciated
#define GDUIE_GHHDFIE_MASK               This_symb_has_been_depreciated
#define GDUPHS                           This_symb_has_been_depreciated
#define GDUPHS_MASK                      This_symb_has_been_depreciated
#define GDUPHS_BITNUM                    This_symb_has_been_depreciated
#define GDUPHS_GPHS0                     This_symb_has_been_depreciated
#define GDUPHS_GPHS1                     This_symb_has_been_depreciated
#define GDUPHS_GPHS2                     This_symb_has_been_depreciated
#define GDUPHS_GPHS0_MASK                This_symb_has_been_depreciated
#define GDUPHS_GPHS1_MASK                This_symb_has_been_depreciated
#define GDUPHS_GPHS2_MASK                This_symb_has_been_depreciated
#define GDUCSO_GCS0O                     This_symb_has_been_depreciated
#define GDUCSO_GCS1O                     This_symb_has_been_depreciated
#define GDUCSO_GCS0O_MASK                This_symb_has_been_depreciated
#define GDUCSO_GCS1O_MASK                This_symb_has_been_depreciated
#define GDUCSO_GCS0O_BITNUM              This_symb_has_been_depreciated
#define GDUCSO_GCS1O_BITNUM              This_symb_has_been_depreciated
#define PTUE_PTUWP                       This_symb_has_been_depreciated
#define PTUE_PTUWP_MASK                  This_symb_has_been_depreciated

