podonoghue/usbdm-flash-routines/S12Z-FTMRZ-flash-program/Project_Headers/mc9s12zvml128.h
/* **** 05/16/2013 5:53:17 PM  - updates for new silicon revision (V3.0) */

#define SCI0BDH_TNP0                     This_symb_has_been_depreciated
#define SCI0BDH_TNP1                     This_symb_has_been_depreciated
#define SCI0BDH_IREN                     This_symb_has_been_depreciated
#define SCI0BDH_SBR_8                    This_symb_has_been_depreciated
#define SCI0BDH_TNP                      This_symb_has_been_depreciated
#define SCI0BDH_SBR                      This_symb_has_been_depreciated
#define SCI0BDH_TNP0_MASK                This_symb_has_been_depreciated
#define SCI0BDH_TNP1_MASK                This_symb_has_been_depreciated
#define SCI0BDH_IREN_MASK                This_symb_has_been_depreciated
#define SCI0BDH_SBR_8_MASK               This_symb_has_been_depreciated
#define SCI0BDH_SBR_8_BITNUM             This_symb_has_been_depreciated
#define SCI0BDH_TNP_MASK                 This_symb_has_been_depreciated
#define SCI0BDH_TNP_BITNUM               This_symb_has_been_depreciated
#define SCI0BD_TNP0                      This_symb_has_been_depreciated
#define SCI0BD_TNP1                      This_symb_has_been_depreciated
#define SCI0BD_IREN                      This_symb_has_been_depreciated
#define SCI0BD_SBR                       This_symb_has_been_depreciated
#define SCI0BD_TNP                       This_symb_has_been_depreciated
#define SCI0BD_TNP0_MASK                 This_symb_has_been_depreciated
#define SCI0BD_TNP1_MASK                 This_symb_has_been_depreciated
#define SCI0BD_IREN_MASK                 This_symb_has_been_depreciated
#define SCI0BD_SBR_MASK                  This_symb_has_been_depreciated
#define SCI0BD_SBR_BITNUM                This_symb_has_been_depreciated
#define SCI0BD_TNP_MASK                  This_symb_has_been_depreciated
#define SCI0BD_TNP_BITNUM                This_symb_has_been_depreciated
#define SCI1BDH_TNP0                     This_symb_has_been_depreciated
#define SCI1BDH_TNP1                     This_symb_has_been_depreciated
#define SCI1BDH_IREN                     This_symb_has_been_depreciated
#define SCI1BDH_SBR_8                    This_symb_has_been_depreciated
#define SCI1BDH_TNP                      This_symb_has_been_depreciated
#define SCI1BDH_SBR                      This_symb_has_been_depreciated
#define SCI1BDH_TNP0_MASK                This_symb_has_been_depreciated
#define SCI1BDH_TNP1_MASK                This_symb_has_been_depreciated
#define SCI1BDH_IREN_MASK                This_symb_has_been_depreciated
#define SCI1BDH_SBR_8_MASK               This_symb_has_been_depreciated
#define SCI1BDH_SBR_8_BITNUM             This_symb_has_been_depreciated
#define SCI1BDH_TNP_MASK                 This_symb_has_been_depreciated
#define SCI1BDH_TNP_BITNUM               This_symb_has_been_depreciated
#define SCI1BD_TNP0                      This_symb_has_been_depreciated
#define SCI1BD_TNP1                      This_symb_has_been_depreciated
#define SCI1BD_IREN                      This_symb_has_been_depreciated
#define SCI1BD_SBR                       This_symb_has_been_depreciated
#define SCI1BD_TNP                       This_symb_has_been_depreciated
#define SCI1BD_TNP0_MASK                 This_symb_has_been_depreciated
#define SCI1BD_TNP1_MASK                 This_symb_has_been_depreciated
#define SCI1BD_IREN_MASK                 This_symb_has_been_depreciated
#define SCI1BD_SBR_MASK                  This_symb_has_been_depreciated
#define SCI1BD_SBR_BITNUM                This_symb_has_been_depreciated
#define SCI1BD_TNP_MASK                  This_symb_has_been_depreciated
#define SCI1BD_TNP_BITNUM                This_symb_has_been_depreciated
#define LP0SLR_LPSLRWD                   This_symb_has_been_depreciated
#define LP0SLR_LPSLRWD_MASK              This_symb_has_been_depreciated
#define LP0SLR                           LP0SLRM
#define LP0SLR_LPSLR                     LP0SLRM_LPSLR
#define LP0SLR_LPSLR_MASK                LP0SLRM_LPSLR_MASK
#define LP0SLR_LPSLR_BITNUM              LP0SLRM_LPSLR_BITNUM
#define LP0SR_LPOC                       This_symb_has_been_depreciated
#define LP0SR_LPOC_MASK                  This_symb_has_been_depreciated

/*lint -restore  +esym(960,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
#endif
